nxp-mcuxpresso/mcux-sdk-examples/mimxrt700evk/driver_examples/lcdif/gamma/cm33_core0/pin_mux.c
    const uint32_t port2_pin13_config = (/* Pin is configured as LCDIF_DBI_DATA7 */
                                         IOPCTL_PIO_FUNC7 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLUP_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT2 PIN13 (coords: E4) is configured as LCDIF_DBI_DATA7 */
    IOPCTL_PinMuxSet(2U, 13U, port2_pin13_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
